{
  "web_dev": "Fullstack Web Developer",
  "projects": "Projects",
  "educations": "Educations",
  "testimonials": "Testimonials",
  "contact": "Contact",
  "studies_subtitle": "My career transition journey started in 2019 at the age of 25.",
  "projects_subtitle": "The solutions I am proud of, made for customer orders or personal projects.",
  "contact_subtitle": "A project in mind? A question? I will be happy to answer you!",
  "obie_dates": "June 2022 - Present",
  "obie_description_1": "Obie is a web application for Swiss workers or cross-border commuters to facilitate the recovery of their LPP assets.",
  "obie_description_2": "I hold the role of lead developer and work in collaboration with my client, who is in charge of the business rules.",
  "obie_description_3": "The main features are:",
  "obie_feature_1_0": "Public landing page",
  "obie_feature_1_1": "presenting the product",
  "obie_feature_2_0": "Advanced form",
  "obie_feature_2_1": "search for LPP assets",
  "obie_feature_3_0": "Secure administrator dashboard",
  "obie_feature_3_1": "offering total data management",
  "obie_feature_4_0": "Emailing",
  "obie_feature_4_1": "customized",
  "obie_feature_5_0": "PDF Generation",
  "obie_feature_6_0": "Full multi-language management",
  "apprenticeship": "Apprenticeship",
  "professor": "Professor",
  "name": "Name",
  "send": "Send",
  "contact_success": "Thank you, I will contact you soon!",
  "contact_error": "Oops, an error has occurred. I'll take care of it quickly!",
  "bio": "I am a <span>28 years old</span> passionate developer based in Toulouse.<br /> I like to design and develop <span>powerful</span> and <span>modern</span> solutions while taking special care of the <span>user experience</span>.<br />I'm constantly learning and trying to produce a <span>quality code</span> respecting the <span>best practices</span>.<br />I have been working for <span>3 years</span> at <span>Ubigreen</span> as a <span>fullstack web developer</span>.<br />Since almost <span>1 year</span> I'm also working on <span>Obie</span>, a customer order that will be released very soon.<br />When I'm offline, I spend my time in the <span>nature</span> to train for my future trail competitions. ⛰️",
  "blabble_description": "Blabble is a real-time chat application.<br /><br />Being quite familiar with REST APIs, I decided to develop this small project to learn how to build applications around <strong>GraphQL</strong>.<br /><br />I focused on the design of the different mutations and GraphQL queries and on the updating of the data in real time thanks to the subscription system.<br /><br />The backend uses the <strong>GraphQL Yoga</strong> library while the database modeling is done using the <strong>Prisma</strong> ORM.<br /><br />The <strong>TypeScript</strong> React application uses the <a href='https://react95.io' target='_blank'>React 95</a> UI library, which gives a retro feel that reminds me of years past when I was a kid in front of the old home Windows. It consumes the GraphQL API thanks to <strong>Apollo Server</strong>.",
  "racequest_description": "RaceQuest is a mobile application that allows running enthusiasts to create and participate in ephemeral fictives competitions around their local area.<br/>The app aims to energize runners' training, help them discover new spots, and stimulate their competitive spirit. <br/><br/> Currently under development, my application uses <strong>React Native</strong> and features a competition creation form that allows the user to choose their running distance, starting point, and the duration of the competition. <br/>Subsequently, an algorithm in my <strong>NestJS</strong> API calculates routes based on the user's chosen parameters and proposes them to the user.<br/><br/> I have chosen to opt for a monorepo architecture with Lerna. My data is stored in a <strong>Postgres SQL</strong> database with Supabase, and all the code is typed thanks to <strong>TypeScript</strong>. <br/><br/>As this is my main project, many more features are to come like an in app trace editor, social features, exporting traces to Garmin, etc.",
  "source_code": "Source code"
}
