{
  "web_dev": "Développeur Web Fullstack",
  "projects": "Projets",
  "educations": "Études",
  "testimonials": "Témoignages",
  "contact": "Contact",
  "studies_subtitle": "Mon parcours de reconversion professionnelle entrepris en 2019 à l'âge de 25 ans.",
  "projects_subtitle": "Les solutions dont je suis fier, réalisées dans le cadre de commande client ou de projet personnel.",
  "contact_subtitle": "Un projet en tête ? Une question ? Je me ferais un plaisir de vous répondre !",
  "obie_dates": "Juin 2022 - Présent",
  "obie_description_1": "Obie est une application web destinée aux travailleurs ou frontaliers suisses facilitant la récupération de leurs avoirs LPP.",
  "obie_description_2": "Je tiens le rôle de concepteur développeur et travaille en collaboration avec mon client qui est maitre des règles métiers.",
  "obie_description_3": "Les fonctionnalités principales sont :",
  "obie_feature_1_0": "Landing page publique",
  "obie_feature_1_1": "présentant le produit",
  "obie_feature_2_0": "Formulaire avancé",
  "obie_feature_2_1": "de recherche d'avoirs LPP",
  "obie_feature_3_0": "Dashboard administrateur sécurisé",
  "obie_feature_3_1": "proposant une gestion totale des données",
  "obie_feature_4_0": "Emailing",
  "obie_feature_4_1": "sur mesure",
  "obie_feature_5_0": "Génération de PDF",
  "obie_feature_6_0": "Gestion intégrale multi-langues",
  "apprenticeship": "Alternance",
  "professor": "Formateur",
  "name": "Nom",
  "send": "Envoyer",
  "contact_success": "Merci, je vous recontacte très vite !",
  "contact_error": "Oupsi, une erreur est survenue. Je m'occupe de ça rapidement !",
  "bio": "Je suis un développeur passionné de <span>28 ans</span> basé à Toulouse.<br /> J’aime designer, concevoir et développer des solutions <span>performantes</span> et <span>modernes</span> tout en apportant un soin particulier à l’<span>expérience utilisateur</span>.<br />Je me forme constamment et essai de produire un <span>code de qualité</span> respectant au maximum les <span>bonnes pratiques</span>.<br />Je travaille depuis <span>3 ans</span> chez <span>Ubigreen</span> en tant qu’alternant <span>développeur web fullstack</span>.<br />Depuis bientôt <span>1 an</span> je tiens aussi le rôle de <span>concepteur développeur</span> sur <span>Obie</span>, une commande client qui verra le jour très prochainement.<br />Quand je suis déconnecté , je passe mon temps dans la <span>nature</span> à m'entrainer pour mes futures compétitions de trail. ⛰️",
  "blabble_description": "Blabble est une application de chat en temps réel. <br /><br />Étant plutôt familier avec les APIs REST, j’ai décidé de développer ce petit projet pour apprendre comment construire des applications autour de <strong>GraphQL</strong>.<br /><br />Je me suis focalisé sur la conception des différentes mutations et requêtes GraphQL et sur la mise à jour des données en temps réel grâce au système de subscription. <br /><br />Le backend utilise la bibliothèque <strong>GraphQL Yoga</strong> tandis que la modélisation de la base de données est faite grâce à l’ORM <strong>Prisma</strong>.<br /><br />L'application React en <strong>TypeScript</strong> utilise la bibliothèque UI <a href='https://react95.io' target='_blank'>React 95</a> et consomme l’API GraphQL grâce à <strong>Apollo Server</strong>.",
  "racequest_description": "RaceQuest est une application mobile permettant aux passionnés de course à pied de créer et de participer à des compétitions fictives éphémères autour de chez eux.<br/>L'application vise à dynamiser l'entraînement des coureurs, à leur faire découvrir de nouveaux spots et à stimuler leur esprit de compétition.<br/><br/> Actuellement en cours de développement, mon application utilise <strong>React Native</strong> et est composée d'un formulaire de création de compétition permettant à l'utilisateur de choisir sa distance de course, son point de départ et la durée de la compétition. <br/>Ensuite, un algorithme dans mon API <strong>NestJS</strong> calcule des parcours en fonction des paramètres choisis par l'utilisateur et les lui propose.<br/><br/> J'ai choisi d'opter pour une architecture monorepo avec Lerna. Mes données sont stockées dans une base de données <strong>Postgres SQL</strong> chez Supabase et tout le code est typé grâce à <strong>TypeScript</strong>. <br/><br/>Comme il s'agit de mon projet principal, de nombreuses fonctionnalités sont à venir !",
  "source_code": "Code source"
}
